In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns
from datetime import datetime,date,timedelta

### 1. Load `Table1_Customer_Details` into Pandas

In [2]:
# Load the Excel file to Pandas and list all the sheets

xls = pd.ExcelFile('Spreadsheets_Exercises.xlsx')
xls.sheet_names

['Table1_CustDetails',
 'Table2_ContractType',
 'Table3_PhoneService',
 'Table4_InternetService',
 'Table5_Dates',
 'Table6_Holidays',
 'Table7_Users',
 'Table8_Sparklines']

In [3]:
CustDetails = xls.parse('Table1_CustDetails')
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes

In [4]:
CustDetails.shape

(7049, 12)

### 2.Compute monthly tenure.

In [5]:
CustDetails['monthly_tenure'] = CustDetails.total_charges/CustDetails.monthly_charges
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128

### 3. Ensure the data format of each field is appropriate for data contained.

In [6]:
CustDetails.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        7049 non-null   object
 1   gender             7049 non-null   object
 2   is_senior_citizen  7049 non-null   int64
 3   partner            7049 non-null   object
 4   dependents         7049 non-null   object
 5   phone_service      7049 non-null   int64
 6   internet_service   7049 non-null   int64
 7   contract_type      7049 non-null   int64
 8   payment_type       7049 non-null   object
 9   monthly_charges    7049 non-null   float64
 10  total_charges      7038 non-null   float64
 11  churn              7049 non-null   object
 12  monthly_tenure     7038 non-null   float64
dtypes: float64(3), int64(4), object(6)
memory usage: 716.0+ KB

### 4. Remove duplicate customer_id's.

In [7]:
# Check how many unique customer_ids in the data frame

CustDetails.customer_id.nunique()

7043

In [8]:
# Delete the extra row records which have the duplicated customer_id. 

CustDetails.drop_duplicates(subset=['customer_id'],inplace=True, ignore_index=True)
CustDetails.customer_id.nunique()

7043

In [9]:
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128

### Using the dates worksheet

In [10]:
dates = xls.parse('Table5_Dates')
dates.head()

        Date  Support Calls  Support Chats  Support Tickets
0 2018-12-01             21             89               69
1 2018-12-02             15             93               80
2 2018-12-03             62            186              197
3 2018-12-04             78            197              150
4 2018-12-05             89            200              158

In [11]:
dates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             33 non-null     datetime64[ns]
 1   Support Calls    33 non-null     int64
 2   Support Chats    33 non-null     int64
 3   Support Tickets  33 non-null     int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 1.2 KB

### 1. Add a new column that is the original date formatted as YYYYMMDD and stored as a date.

In [12]:
dates['Formatted Date'] = dates.Date.apply(lambda i: i.strftime('%Y%m%d'))
dates.head()

        Date  Support Calls  Support Chats  Support Tickets Formatted Date
0 2018-12-01             21             89               69       20181201
1 2018-12-02             15             93               80       20181202
2 2018-12-03             62            186              197       20181203
3 2018-12-04             78            197              150       20181204
4 2018-12-05             89            200              158       20181205

In [13]:
dates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             33 non-null     datetime64[ns]
 1   Support Calls    33 non-null     int64
 2   Support Chats    33 non-null     int64
 3   Support Tickets  33 non-null     int64
 4   Formatted Date   33 non-null     object
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 1.4+ KB

### 2.Insert 4 new columns that contain the weekday, day, month, year.

1. Add a new column named 'Weekday'. It will hold the number weekdays converted from dates using `Series.dt.weekday`. Monday is 0 and Sunday is 6. 
2. Convert the weekdays from numbers to names using `Series.map()`
3. Add new columns named 'Year', 'Month', and 'Day'.

In [14]:
dates['Weekday'] = dates.Date.dt.weekday
dates.head()

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday
0,2018-12-01,21,89,69,20181201,5
1,2018-12-02,15,93,80,20181202,6
2,2018-12-03,62,186,197,20181203,0
3,2018-12-04,78,197,150,20181204,1
4,2018-12-05,89,200,158,20181205,2

In [15]:
dates['Weekday'] = dates['Weekday'].map({0:'Monday', 
                                         1:'Tuesday', 
                                         2:'Wednesday', 
                                         3:'Thursday', 
                                         4:'Friday', 
                                         5:'Saturday', 
                                         6:'Sunday'})
dates.head()

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday
0,2018-12-01,21,89,69,20181201,Saturday
1,2018-12-02,15,93,80,20181202,Sunday
2,2018-12-03,62,186,197,20181203,Monday
3,2018-12-04,78,197,150,20181204,Tuesday
4,2018-12-05,89,200,158,20181205,Wednesday

In [16]:
dates['Year'] = dates.Date.dt.year
print(dates.Year.dtype)
dates.head()

int64

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year
0,2018-12-01,21,89,69,20181201,Saturday,2018
1,2018-12-02,15,93,80,20181202,Sunday,2018
2,2018-12-03,62,186,197,20181203,Monday,2018
3,2018-12-04,78,197,150,20181204,Tuesday,2018
4,2018-12-05,89,200,158,20181205,Wednesday,2018

In [17]:
dates['Month'] = dates.Date.dt.month
print(dates.Month.dtype)
dates.head()

int64

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year,Month
0,2018-12-01,21,89,69,20181201,Saturday,2018,12
1,2018-12-02,15,93,80,20181202,Sunday,2018,12
2,2018-12-03,62,186,197,20181203,Monday,2018,12
3,2018-12-04,78,197,150,20181204,Tuesday,2018,12
4,2018-12-05,89,200,158,20181205,Wednesday,2018,12

In [18]:
dates['Day'] = dates.Date.dt.day
print(dates.Day.dtype)
dates.head()

int64

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year,Month,Day
0,2018-12-01,21,89,69,20181201,Saturday,2018,12,1
1,2018-12-02,15,93,80,20181202,Sunday,2018,12,2
2,2018-12-03,62,186,197,20181203,Monday,2018,12,3
3,2018-12-04,78,197,150,20181204,Tuesday,2018,12,4
4,2018-12-05,89,200,158,20181205,Wednesday,2018,12,5

### 4. Insert 1 new column that computes the number of workdays from the current date (i.e. current row) through the latest date listed in the table. Reference the holidays table in your computation.

In [19]:
# Find out the latest date in the table

date_max = dates.Date.max()
date_max

Timestamp('2019-01-02 00:00:00')

In [20]:
# Reference the holidays table

holidays = xls.parse('Table6_Holidays')
holidays

    Holidays
0 2018-12-25
1 2019-01-01

In [21]:
# Created a variable named holidays_list that contains the holidays in a string format. 

holidays_list = [i.strftime('%Y-%m-%d') for i in holidays.Holidays]
holidays_list

['2018-12-25', '2019-01-01']

In [22]:
# Compute the workdays using np.busday_count()

dates['Workdays'] = dates.Date.apply(lambda i: np.busday_count(i.strftime('%Y-%m-%d'),
                                                               date_max.strftime('%Y-%m-%d'),
                                                               holidays=holidays_list)) + 1
dates.head()

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year,Month,Day,Workdays
0,2018-12-01,21,89,69,20181201,Saturday,2018,12,1,21
1,2018-12-02,15,93,80,20181202,Sunday,2018,12,2,21
2,2018-12-03,62,186,197,20181203,Monday,2018,12,3,21
3,2018-12-04,78,197,150,20181204,Tuesday,2018,12,4,20
4,2018-12-05,89,200,158,20181205,Wednesday,2018,12,5,19

### 4.Insert a new column that contains a 1 if the date is a workday and a 0 if not.

In [23]:
# Create a boolean series that meet the criteria

dates.Weekday.isin(['Saturday','Sunday']).head()

0     True
1     True
2    False
3    False
4    False
Name: Weekday, dtype: bool

In [24]:
dates['Formatted Date'].isin(['20181225','20190101']).head()

0    False
1    False
2    False
3    False
4    False
Name: Formatted Date, dtype: bool

In [25]:
boolean_mask = (dates.Weekday.isin(['Saturday','Sunday'])) | (dates['Formatted Date'].isin(['20181225','20190101']))
boolean_mask.head()

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [26]:
dates['Is Workday'] = boolean_mask
dates.head()

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year,Month,Day,Workdays,Is Workday
0,2018-12-01,21,89,69,20181201,Saturday,2018,12,1,21,True
1,2018-12-02,15,93,80,20181202,Sunday,2018,12,2,21,True
2,2018-12-03,62,186,197,20181203,Monday,2018,12,3,21,False
3,2018-12-04,78,197,150,20181204,Tuesday,2018,12,4,20,False
4,2018-12-05,89,200,158,20181205,Wednesday,2018,12,5,19,False

In [27]:
dates['Is Workday'] = dates['Is Workday'].apply(lambda i: 0 if i else 1)
dates.head()

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year,Month,Day,Workdays,Is Workday
0,2018-12-01,21,89,69,20181201,Saturday,2018,12,1,21,0
1,2018-12-02,15,93,80,20181202,Sunday,2018,12,2,21,0
2,2018-12-03,62,186,197,20181203,Monday,2018,12,3,21,1
3,2018-12-04,78,197,150,20181204,Tuesday,2018,12,4,20,1
4,2018-12-05,89,200,158,20181205,Wednesday,2018,12,5,19,1

### Using the users worksheet

In [28]:
users = xls.parse('Table7_Users')
users.head()

   customer_id            username  domain.tld
0   7590-VHVEG        Olivia.Smith   gmail.com
1   5575-GNVDE         Emma.Garcia   yahoo.com
2   3668-QPYBK         Ava.Johnson   gmail.com
3   7795-CFOCW  Charlotte.Martinez  icloud.com
4   9237-HQITU        Mia.Williams   gmail.com

### 1.Insert a new column that is a clean version of customer_id, trimming any leading or trailing whitespace. All following tasks using the users table should reference the clean customer_id instead of the original.

In [29]:
users.customer_id.apply(lambda i: len(i)).head()

0    11
1    10
2    10
3    10
4    10
Name: customer_id, dtype: int64

In [30]:
users.customer_id = users.customer_id.str.strip()
users.customer_id.apply(lambda i: len(i)).head()

0    10
1    10
2    10
3    10
4    10
Name: customer_id, dtype: int64

### 2. Split the customer id into 2 columns where the characters before the hyphen are one column and the characters after the hyphen are another. Ensure the data format of these new columns is appropriate for the data contained. This might require multiple steps.

In [31]:
username_split = users.customer_id.str.split('-').to_list()
df = pd.DataFrame(username_split,
                 columns = ['id_numbers','id_letters'])
df.head

<bound method NDFrame.head of    id_numbers id_letters
0        7590      VHVEG
1        5575      GNVDE
2        3668      QPYBK
3        7795      CFOCW
4        9237      HQITU
5        9305      CDSKC
6        1452      KIOVK
7        6713      OKOMC
8        7892      POOKP
9        6388      TABGU
10       9763      GRSKD
11       7469      LKBCI
12       8091      TTVAX
13       0280      XJGEX
14       5129      JLPIS
15       3655      SNQYZ
16       8191      XWSZG
17       9959      WOFKT
18       4190      MFLUW
19       4183      MYFRB
20       8779      QRDMV
21       1680      VDCWW
22       1066      JKSGK
23       4472      LVYGI
24       3638      WEABW>

In [32]:
df.index

RangeIndex(start=0, stop=25, step=1)

In [33]:
users.index

RangeIndex(start=0, stop=25, step=1)

In [34]:
users = pd.merge(users, df, on=users.index, how='inner')
users.head()

   key_0 customer_id            username  domain.tld id_numbers id_letters
0      0  7590-VHVEG        Olivia.Smith   gmail.com       7590      VHVEG
1      1  5575-GNVDE         Emma.Garcia   yahoo.com       5575      GNVDE
2      2  3668-QPYBK         Ava.Johnson   gmail.com       3668      QPYBK
3      3  7795-CFOCW  Charlotte.Martinez  icloud.com       7795      CFOCW
4      4  9237-HQITU        Mia.Williams   gmail.com       9237      HQITU

### 3.Add the email address for each customer, using the data available in this table.

In [35]:
"@".join([users.username.iat[0],users['domain.tld'].iat[0]])

'Olivia.Smith@gmail.com'

In [36]:
users['email'] = ["@".join([users.username.iat[i],users['domain.tld'].iat[i]]) for i in users.index]
users.head()

,key_0,customer_id,username,domain.tld,id_numbers,id_letters,email
0,0,7590-VHVEG,Olivia.Smith,gmail.com,7590,VHVEG,Olivia.Smith@gmail.com
1,1,5575-GNVDE,Emma.Garcia,yahoo.com,5575,GNVDE,Emma.Garcia@yahoo.com
2,2,3668-QPYBK,Ava.Johnson,gmail.com,3668,QPYBK,Ava.Johnson@gmail.com
3,3,7795-CFOCW,Charlotte.Martinez,icloud.com,7795,CFOCW,Charlotte.Martinez@icloud.com
4,4,9237-HQITU,Mia.Williams,gmail.com,9237,HQITU,Mia.Williams@gmail.com

### Using your customer details worksheet

In [37]:
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128

### 1. Add new columns, is_female, has_churned, has_phone, has_internet, and has_phone_and_internet. Populate these fields with the applicable boolean value (TRUE or FALSE).

In [38]:
CustDetails['is_Female'] = CustDetails.gender.apply(lambda i: True if i == 'Female' else (False if i == 'Male' else "Error"))
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True

In [39]:
CustDetails['has_churned'] = CustDetails.churn.map({'No':False,'Yes':True})
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True,False
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False,False
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False,True
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False,True
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True,True

In [40]:
# Check Table4_InternetService

internet = xls.parse('Table4_InternetService')
internet

   internet_service_id internet_service_description
0                    0          No Internet Service
1                    1                          DSL
2                    2                  Fiber Optic

In [41]:
CustDetails['has_internet'] = CustDetails.internet_service.map({0:'False', 1:True, 2:True})
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned,has_internet
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True,False,True
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False,False,True
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False,True,True
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False,True,True
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True,True,True

In [42]:
phone = xls.parse('Table3_PhoneService')
phone

   phone_service_id phone_service_description
0                 0          No Phone Service
1                 1                  One Line
2                 2         Two or More Lines

In [43]:
CustDetails['has_phone'] = CustDetails.phone_service.map({0:'False', 1:True, 2:True})
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned,has_internet,has_phone
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True,False,True,True
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False,False,True,True
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False,True,True,True
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False,True,True,True
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True,True,True,True

In [44]:
boolean_phone = (CustDetails.phone_service == 1)|(CustDetails.phone_service == 2)
boolean_phone

0        True
1        True
2        True
3        True
4        True
        ...
7038     True
7039     True
7040     True
7041     True
7042    False
Name: phone_service, Length: 7043, dtype: bool

In [45]:
boolean_internet = (CustDetails.internet_service == 1)|(CustDetails.internet_service == 2)
boolean_internet

0       True
1       True
2       True
3       True
4       True
        ...
7038    True
7039    True
7040    True
7041    True
7042    True
Name: internet_service, Length: 7043, dtype: bool

In [46]:
CustDetails['has_phone_and_internet'] = boolean_phone & boolean_internet

In [47]:
CustDetails.tail()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned,has_internet,has_phone,has_phone_and_internet
7038,9987-LUTYD,Female,0,No,No,1,1,1,Mailed check,55.15,742.90,No,13.470535,True,False,True,True,True
7039,9992-RRAMN,Male,0,Yes,No,2,2,0,Electronic check,85.10,1873.70,Yes,22.017626,False,True,True,True,True
7040,9992-UJOEL,Male,0,No,No,1,1,0,Mailed check,50.30,92.75,No,1.843936,False,False,True,True,True
7041,9993-LHIEB,Male,0,Yes,Yes,1,1,2,Mailed check,67.85,4627.65,No,68.204127,False,False,True,True,True
7042,9995-HOTOH,Male,0,Yes,Yes,0,1,2,Electronic check,59.00,3707.60,No,62.840678,False,False,True,False,False

### 2. Insert a new column partner_dependents that returns a 0 for no partners and no dependents, 1 indicates partner only, 2 indicates dependents only, 3 indicates partner & dependents.

In [48]:
# if...else (functin) --> apply to rows

CustDetails.iloc[7042]['partner']

'Yes'

In [49]:
def partner_dependents(row):
    if row['partner'] == "No" and row['dependents'] == "No":
        return 0
    elif row['partner'] == "Yes" and row['dependents'] == "No":
        return 1
    elif row['partner'] == "No" and row['dependents'] == "Yes":
        return 2
    elif row['partner'] == "Yes" and row['dependents'] == "Yes":
        return 3
    else:
        return "Value Error"
    
partner_dependents(CustDetails.iloc[7042])

3

In [50]:
CustDetails['partner_dependents'] = CustDetails.apply(partner_dependents,axis=1)
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned,has_internet,has_phone,has_phone_and_internet,partner_dependents
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True,False,True,True,True,3
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False,False,True,True,True,0
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False,True,True,True,True,0
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False,True,True,True,True,1
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True,True,True,True,True,1

In [ ]:
# How do I do data validation?

### 3. Insert a new field that computes the start date, based on the assumption that the tenure was calculated today. Format the columns to be YYYY-MM-DD.

In [136]:
(date.today() - timedelta(days=CustDetails['monthly_tenure'][1]*30.4)).isoformat()

'2019-11-20'

In [133]:
# Can't use list comprehension due to the NaN vaue in the montly_tenure column. 
CustDetails['monthly_tenure'].hasnans

True

In [167]:
CustDetails.monthly_tenure.iloc[945]

nan

In [169]:
def start_date(tenure):
    if str(tenure) == 'nan':
        return 'Nan'
    else:
        return (date.today() - timedelta(days = tenure*30.4)).isoformat()
    
CustDetails['start_date'] = CustDetails.monthly_tenure.apply(start_date)

In [170]:
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned,has_internet,has_phone,has_phone_and_internet,partner_dependents,start_date
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True,False,True,True,True,3,2019-11-21
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False,False,True,True,True,0,2019-11-20
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False,True,True,True,True,0,2020-04-28
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False,True,True,True,True,1,2019-08-04
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True,True,True,True,True,1,2020-05-17

### 4. Insert a new column that computes average monthly charges using total_charges and tenure. (do not copy the "monthly_charges" column). Format the data type appropriately. Use a function to validate that your calculations match the original field monthly_charges.

In [172]:
CustDetails['average_monthly'] = CustDetails.total_charges/CustDetails.monthly_tenure
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,churn,monthly_tenure,is_Female,has_churned,has_internet,has_phone,has_phone_and_internet,partner_dependents,start_date,average_monthly
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,...,No,9.044207,True,False,True,True,True,3,2019-11-21,65.6
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,...,No,9.055092,False,False,True,True,True,0,2019-11-20,59.9
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,...,Yes,3.800406,False,True,True,True,True,0,2020-04-28,73.9
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,...,Yes,12.631122,False,True,True,True,True,1,2019-08-04,98.0
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,...,Yes,3.187128,True,True,True,True,True,1,2020-05-17,83.9